app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("Damage", "Leins", "Make", "Mileage", "Model", "Price", "Running", "Seller", "Year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)